
/* ======================
 প্রাকটিস-1: 
=========================
১. তোমাকে যদি বলি একটা স্ট্রিং টাইপের ভেরিয়েবল লিখো। একটা বুলিয়ান টাইপের ভেরিয়েবল লিখো বা একটা নাম্বার টাইপের ভেরিয়েবল লিখো। সেটা কি তুমি লিখতে পারবে? যদি পারো তাহলে ভিজুয়াল ষ্টুডিও কোড খুলে লিখে ফেলো। 
*/
// var string = 'Shuvo';
// var number = 120;
// var boolean = true;


/* ======================
 প্রাকটিস-2: 
=========================
২. তুমি কি জানো কখন let দিয়ে ভেরিয়েবল লিখতে হয়ে আর কখন const দিয়ে ভেরিয়েবল লিখতে হয়। যদি লিখতে পারো তাহলে লিখে ফেলো। এবং যেই যেটা দিয়ে ভেরিয়েবল লিখলে আবার সেটা চেইঞ্জ করা যায়। তাহলে যেটা দিয়ে ভেরিয়েবল ডিক্লেয়ার করলে চেইঞ্জ করা যায়। সেটার মান চেইঞ্জ করে নাও । অর্থাৎ জাস্ট দুইটা ভেরিয়েবল ডিক্লেয়ার করবে let এবং const দিয়ে। তারপর যেকোন একটার ভ্যালু চেইঞ্জ করবে। এই let এবং const মাথা গরম করে দিলে টেনশন নিয়ে না। সামনের মাইলস্টোন এর পরের মাইলস্টোন এ এইটা নিয়ে আরো ডিসকাস করা হবে। 
*/

// let changableVariable = 'Yes'; 
// const constCantBeChanged = 'ok'; 
// changableVariable = 'Yes Yes';
// console.log(changableVariable);


/* ======================
 প্রাকটিস-3: 
=========================
৩. দুইটা ভেরিয়েবল এর মধ্যে যোগ, বিয়োগ, গুণ, ভাগ কিভাবে করতে হয় সেটা কি জানো। অর্থাৎ তুমি কি +, -, *, /, %এইগুলার ব্যবহার জানো। তাহলে নাম্বার টাইপের দুইটা ভেরিয়েবল লিখো তারপর তাদের যোগ করে সেটার মান আরেকটা ভেরিয়েবল এ রাখো। একইভাবে ওই দুইটা ভেরিয়েবল এর মধ্যে বিয়োগ, গুন, ভাগ এবং ভাগশেষ বের করো। 
*/
// let num1 = 50;
// let num2 = 80;

// let sum = num1 + num2;
// let sab = num1 - num2;
// let mul = num1 * num2;
// let div = num1 / num2;
// let run = num1 % num2;
// console.log(sum, sab, mul, div, run);


/* ======================
 প্রাকটিস-4: 
=========================
৪. তুমি কি দুইটা ভেরিয়েবল এরমধ্যে তুলনা করতে পারো। কম্পারিজন করতে পারো। যে দুইটা ভেরিয়েবল এর মধ্যে প্রথমটা সেকেন্ডটা এর চাইতে ছোট, বড়, অসমান, সমান , ছোট বা সমান, বড় বা সমান। এইগুলা চেক করতে পারো। অর্থাৎ <, >, ==, !=, <=, >= চিহ্নগুলা ব্যবহার করতে পারো। তাহলে দুইটা সংখ্যা টাইপের ভেরিয়েবল ডিক্লেয়ার করে তাদেরকে এই ছয়ভাবে তুলনা করে কোড লিখে ফেলো।
*/
// let num1 = 10;
// let num2 = 20;

// // Smaller Than, Greated Than
// if (num1 < num2) {
//     console.log(num1, 'is smaller than:', num2);
// }
// else {
//     console.log(num2, 'is smaller than:', num1);
// }

// // Not Equal
// if (num1 != num2) {
//     console.log('Osoman');
// }
// else {
//     console.log('Soman');
// }

// // Equal
// if (num1 == num2) {
//     console.log('Soman');
// }
// else {
//     console.log('Osoman');
// }

// // Less Than Equal
// if (num1 <= num2) {
//     console.log('Less Than Equal');
// }
// else {
//     console.log('Greated Than');
// }

// // Greater Than Equal
// if (num1 >= num2) {
//     console.log('Greater Than Equal');
// }
// else {
//     console.log('Less Than');
// }





/* ======================
 প্রাকটিস-5: 
=========================
৫. তোমার যদি দুইটা শর্ত পূরণ করতে বলে। এবং দুইটা শর্তের মধ্যে দুইটাই পূরণ করতে হবে। তাহলে তুমি কি সেটা চেক করতে পারবে? একইভাবে যদি বলে তুমি দুইটা শর্তের যেকোন একটা পূরণ করতে পারবে। অর্থাৎ তুমি && এবং || এর ব্যবহার করতে পারো কিনা। যদি পারো তাহলে নিজে নিজে এই রকমের কোড লিখে ফেলো। 
*/

// let One = 10;
// let Two = 15;

// if (One == 10 || Two == 11) {
//     console.log('Evn');
// }
// else {
//     console.log('Odd');
// }

// if (One == 10 && Two == 11) { 
//     console.log('Even');
// }
// else {
//     console.log('Odd');
// }




/* ======================
 প্রাকটিস-6: 
=========================
৬. তুমি কি একটা শর্ত পালন করলে একটা কিছু করবে। শর্ত পূরণ না করলে অন্য কিছু একটা করবে এমন কোড লিখতে পারবে। অর্থাৎ তুমি কি if-else এর কোড লিখতে পারবে। পারলে একটা কোড লিখে ফেলো
*/

// let num1 = 8;
// let num2 = 4;

// if(num1 != num2){
//     var sum = (num1 + num2);
//     console.log(sum);
// }
// else{
//     var sub =(num1 - num2);
//     console.log(sub);
// }



/* ======================
 প্রাকটিস-7: 
=========================
৭. তোমাকে যদি বলে একটা while লুপ দিয়ে ৭ থেকে ১৯ পর্যন্ত যতগুলা বিজোড় সংখ্যা আছে সেগুলা দেখাতে। তুমি কি সেটা দেখাতে পারবে? পারলে সেই কোড লিখে ফেলো। 
*/

// var number = 7;
// while (number <= 19){
//     console.log(i);
//     number += 2;
// }



/* ======================
 প্রাকটিস-8: 
=========================
৮. তোমাকে যদি বলা হয় তুমি একটা array ডিক্লেয়ার করবে। এবং সেটার মধ্যে কয়টা উপাদান আছে সেটা বের করবে হবে। সেই array এর এর মধ্যে চতুর্থ পজিশন এর উপাদান চেইঞ্জ করতে হবে। array এর মধ্যে দুইটা উপাদান যোগ করতে হবে। এবং একটা উপাদান কে বের করে দিতে হবে। তুমি কি সেটা করতে পারবে। 
*/

// var array = [1, 2, 6, 3, 12, 45, 18];
// console.log(array.length);
// array[3] = 77;
// array.push(50,52);
// console.log(array);



/* ======================
 প্রাকটিস-9: 
=========================
৯. তুমি কি একটা ফর লুপ দিয়ে কোন একটা array এর সবগুলা উপাদানকে দেখাতে পারবে। সেটা রেগুলার for লুপ হোক বা for of হোক। হলে সেই স্টাইলে একটা কোড লিখে ফেলো। 
*/

// var array = [1, 2, 6, 3, 12, 45, 18];
// for(i = 0; i < array.length; i++){
//     console.log(array[i]);
// }


/* ======================
 প্রাকটিস-10: 
=========================
১০. তোমাকে যদি বলা হয়। একটা array এর মধ্যে ৮০ এর চাইতে বড় সংখ্যা থাকলে সেগুলাকে console log করে দেখাতে সেটা কি তুমি পারবে? তাহলে তুমি সেই কোড করে ফেলো |
*/
// var number = [10, 20, 50, 55, 70, 80, 90, 100];
// for(let i = 0; i < number.length; i++){
//     const element = number[i];
//     if(element < 80){
//         continue;
//     }
//     console.log(element);
// }


/* ======================
 প্রাকটিস-11: 
=========================
১১. তিনটা সংখ্যার গুনফল বের করে ফাইনাল রেজাল্ট আউটপুট হিসেবে রিটার্ন করতে হবে। তুমি কি সেই কোড লিখতে পারবে। যদি পারো তাহলে সেই কোড লিখে ফেলো।
*/
// let num1 = 20;
// let num2 = 10;
// let num3 = 30;

// let total = num1 * num2 * num3;
// console.log(total);

// =======================

// function gunFol(num1, num2, num3) {
  
//     const total = num1 + num2 + num3;
//     const avast = total * 3;
//     return avast;
// }
// const num1 = 10;
// const num2 = 20;
// const num3 = 30;


// var result = gunFol(num1, num2, num3);
// console.log(result);



/* ======================
 প্রাকটিস-12: 
=========================
১২. একটা অবজেক্ট ডিক্লেয়ার করবে। সেটাতে তিনটা প্রপার্টি থাকবে। এবং কোন একটা প্রোপার্টি এর মান চেইঞ্জ করবা। 
*/

// var student = {
//     id:'10001',
//     name:'Shuvo',
//     class:'diploma',
    
// }
// student.class = 'computer engneer';
// console.log(student);